config/gptel/scope/scope-core.org
#+title: GPTEL Scope Manager - Core Infrastructure
#+author: Jeff Farr
#+property: header-args:elisp :tangle scope-core.el :comments both

* Overview

This module provides the core infrastructure for scope-aware tools in gptel sessions. It implements:
- Generic =gptel-make-scoped-tool= macro that eliminates boilerplate
- Tool-specific validators for fine-grained permission control
- YAML plan parser/formatter for v2.0 tool-level permission format

** Architecture (v2.0)

The scope system uses YAML plan documents stored alongside context files:
- Location: Same directory as =session.md= (e.g., =~/.gptel/sessions/SESSION_ID/branches/main/scope.yml=)
- Format: v2.0 YAML with tool-level permissions (write_file_in_scope, edit_file_in_scope, etc.)
- Default policy: Deny by default, explicit tool configuration required
- Convention: Filesystem is source of truth, no in-memory tracking needed

Example scope.yml structure:
#+begin_example yaml
paths:
  read: ["/**"]
  write: ["/project/**"]
  deny: ["**/.git/**", "**/.env"]

org_roam_patterns:
  subdirectory: ["gptel/**"]
  tags: ["gptel"]

bash_tools:
  categories:
    read_only:
      commands: [ls, find, grep, cat, pwd]
    safe_write:
      commands: [mkdir, touch, echo]
    dangerous:
      commands: []
  deny: [rm, sudo, mv, chmod]
#+end_example

** Key Design Principles

1. *Tool-level permissions*: Each tool has independent configuration (write_file vs edit_file)
2. *Generic macro eliminates duplication*: =gptel-make-scoped-tool= handles all boilerplate
3. *Structured errors returned to LLM*: Tools return descriptive errors, not exceptions
4. *LLM mediates user communication*: No automatic prompts, LLM uses request_scope_expansion
5. *Read operations scope-controlled*: But templates grant permissive =/**= patterns by default

** Module Organization

This module is organized into the following sections:

1. *Dependencies* - Required modules
2. *Tool Categorization System* - Maps tools to validation strategies
3. *Tool Wrapper Macro* - Public API for creating scoped tools
4. *Scope Configuration Location Convention* - Filesystem conventions
5. *Configuration Loading Functions* - Load and parse scope.yml
6. *Allow-Once Mechanism* - Temporary permissions for single use
7. *Validation System* - Validators for each tool category
8. *Glob Pattern Matching* - Utility functions for path matching
9. *Error Formatting* - Standardized error responses

*Note:* Sections are ordered by dependency relationships rather than conceptual grouping.
For example, glob pattern matching appears after validation system because it's
called by validators, even though conceptually it could be in a utilities section.

* Dependencies

#+begin_src elisp
(require 'cl-lib)
(require 'gptel-session-constants)
(require 'gptel-session-logging)
#+end_src

* Tool Categorization System

This section defines the mapping from tool names to validation strategies.

** Tool Category Constant

The core categorization system maps each tool to its validation strategy and operation type.

#+begin_src elisp
(defconst jf/gptel-scope--tool-categories
  '(;; Path-based: read operations
    ("read_file" . (:validation path :operation read))
    ("list_project_files" . (:validation path :operation read))
    ("list_project_directories" . (:validation path :operation read))
    ("search_project_content" . (:validation path :operation read))
    ("list_test_files" . (:validation path :operation read))
    ("find_related_test" . (:validation path :operation read))
    ("find_related_files" . (:validation path :operation read))
    ("check_ggtags_project" . (:validation path :operation read))
    ("find_definition" . (:validation path :operation read))
    ("find_references" . (:validation path :operation read))
    ("find_symbol" . (:validation path :operation read))
    ("get_node_at_position" . (:validation path :operation read))
    ("get_node_info" . (:validation path :operation read))
    ("get_node_context" . (:validation path :operation read))
    ("get_syntax_tree" . (:validation path :operation read))
    ("list_functions" . (:validation path :operation read))
    ("list_classes" . (:validation path :operation read))
    ("list_imports" . (:validation path :operation read))
    ("extract_definition" . (:validation path :operation read))
    ("query_nodes" . (:validation path :operation read))
    ("find_nodes_by_type" . (:validation path :operation read))
    ("find_nodes_in_range" . (:validation path :operation read))
    ("get_scope_structure" . (:validation path :operation read))
    ("explain_ggtags_indexing" . (:validation path :operation read))

    ;; Path-based: write operations
    ("write_file_in_scope" . (:validation path :operation write))
    ("edit_file_in_scope" . (:validation path :operation write))
    ("create_ggtags_project" . (:validation path :operation write))
    ("update_ggtags_project" . (:validation path :operation write))

    ;; Pattern-based: org-roam operations
    ("create_roam_node_in_scope" . (:validation pattern :operation write))
    ("add_roam_tags_in_scope" . (:validation pattern :operation write))
    ("link_roam_nodes_in_scope" . (:validation pattern :operation write))

    ;; Command-based: shell operations

    ;; Bash validation: scoped bash commands
    ("run_bash_command" . (:validation bash :operation write))

    ;; Meta tools (always pass)
    ("PersistentAgent" . (:validation meta :operation delegate))
    ("request_scope_expansion" . (:validation meta :operation meta)))
  "Tool → validation strategy mapping.

Each tool maps to a plist with:
  :validation - Validation strategy (path, pattern, command, bash, meta)
  :operation - Operation type (read, write, delegate, meta)

Validation strategies:
  path    - Validate against paths.read/write/deny lists
  pattern - Validate against org_roam_patterns
  bash    - Validate against bash_tools.categories and paths
  meta    - Always allowed (no validation)

Operation types:
  read     - Read-only access
  write    - Write/modify access
  delegate - Delegate to sub-agent
  meta     - Meta-operations (inspect scope, request expansion)")
#+end_src

* Tool Wrapper Macro

This section provides the generic wrapper macro that eliminates boilerplate code in scope-aware tools.

** Argument Normalization

Tool functions receive arguments as vectors (from JSON), but we need to work with lists internally.

#+begin_src elisp
(defun jf/gptel-scope--normalize-args (args)
  "Convert ARGS from vector to list if needed.
Tool functions receive vectors from JSON serialization."
  (if (vectorp args)
      (append args nil)
    args))
#+end_src

