config/gptel/scope/scope-core.el
;; Dependencies


;; [[file:scope-core.org::*Dependencies][Dependencies:1]]
(require 'cl-lib)
(require 'gptel-session-constants)
(require 'gptel-session-logging)
;; Dependencies:1 ends here

;; Tool Category Constant

;; The core categorization system maps each tool to its validation strategy and operation type.


;; [[file:scope-core.org::*Tool Category Constant][Tool Category Constant:1]]
(defconst jf/gptel-scope--tool-categories
  '(;; Path-based: read operations
    ("read_file" . (:validation path :operation read))
    ("list_project_files" . (:validation path :operation read))
    ("list_project_directories" . (:validation path :operation read))
    ("search_project_content" . (:validation path :operation read))
    ("list_test_files" . (:validation path :operation read))
    ("find_related_test" . (:validation path :operation read))
    ("find_related_files" . (:validation path :operation read))
    ("check_ggtags_project" . (:validation path :operation read))
    ("find_definition" . (:validation path :operation read))
    ("find_references" . (:validation path :operation read))
    ("find_symbol" . (:validation path :operation read))
    ("get_node_at_position" . (:validation path :operation read))
    ("get_node_info" . (:validation path :operation read))
    ("get_node_context" . (:validation path :operation read))
    ("get_syntax_tree" . (:validation path :operation read))
    ("list_functions" . (:validation path :operation read))
    ("list_classes" . (:validation path :operation read))
    ("list_imports" . (:validation path :operation read))
    ("extract_definition" . (:validation path :operation read))
    ("query_nodes" . (:validation path :operation read))
    ("find_nodes_by_type" . (:validation path :operation read))
    ("find_nodes_in_range" . (:validation path :operation read))
    ("get_scope_structure" . (:validation path :operation read))
    ("explain_ggtags_indexing" . (:validation path :operation read))

    ;; Path-based: write operations
    ("write_file_in_scope" . (:validation path :operation write))
    ("edit_file_in_scope" . (:validation path :operation write))
    ("create_ggtags_project" . (:validation path :operation write))
    ("update_ggtags_project" . (:validation path :operation write))

    ;; Pattern-based: org-roam operations
    ("create_roam_node_in_scope" . (:validation pattern :operation write))
    ("add_roam_tags_in_scope" . (:validation pattern :operation write))
    ("link_roam_nodes_in_scope" . (:validation pattern :operation write))

    ;; Command-based: shell operations

    ;; Bash validation: scoped bash commands
    ("run_bash_command" . (:validation bash :operation write))

    ;; Meta tools (always pass)
    ("PersistentAgent" . (:validation meta :operation delegate))
    ("request_scope_expansion" . (:validation meta :operation meta)))
  "Tool → validation strategy mapping.

Each tool maps to a plist with:
  :validation - Validation strategy (path, pattern, command, bash, meta)
  :operation - Operation type (read, write, delegate, meta)

Validation strategies:
  path    - Validate against paths.read/write/deny lists
  pattern - Validate against org_roam_patterns
  bash    - Validate against bash_tools.categories and paths
  meta    - Always allowed (no validation)

Operation types:
  read     - Read-only access
  write    - Write/modify access
  delegate - Delegate to sub-agent
  meta     - Meta-operations (inspect scope, request expansion)")
;; Tool Category Constant:1 ends here

;; Argument Normalization

;; Tool functions receive arguments as vectors (from JSON), but we need to work with lists internally.


;; [[file:scope-core.org::*Argument Normalization][Argument Normalization:1]]
(defun jf/gptel-scope--normalize-args (args)
  "Convert ARGS from vector to list if needed.
Tool functions receive vectors from JSON serialization."
  (if (vectorp args)
      (append args nil)
    args))
;; Argument Normalization:1 ends here
