config/gptel/scope/scope-core.org
** Generic Scoped Tool Macro

This macro wraps the common pattern used by all scope-aware tools:
1. Get session ID
2. Load scope plan
3. Check plan exists
4. Validate tool permission
5. Execute tool body if allowed
6. Return formatted error if denied

#+begin_src elisp
(defmacro gptel-make-scoped-tool (name description args category &rest body)
  "Create a scope-aware gptel tool with automatic validation.

NAME: Tool name string (e.g., \"write_file_in_scope\")
DESCRIPTION: Tool description for LLM
ARGS: List of argument specs (same format as gptel-make-tool :args)
CATEGORY: Resource category (\"filesystem\", \"org_roam\", \"shell\")
BODY: Tool implementation - executed only if scope check passes

The macro automatically:
- Loads scope config from scope.yml in current buffer's directory
- Checks tool permission using v3.0 validation
- Normalizes arguments (vector->list)
- Formats errors on scope violation
- Handles exceptions

BODY is executed with tool arguments available as variables and should
return the success result plist. The first argument in ARGS should be
the primary resource identifier (filepath, node-id, command, etc.)."
  (let* ((arg-names (mapcar (lambda (arg-spec)
                             (intern (plist-get arg-spec :name)))
                           (eval args)))
         (lambda-list arg-names))
    `(gptel-make-tool
      :name ,name
      :description ,description
      :args ,args
      :category ,category
      :function
      (lambda (&rest raw-args)
        (condition-case err
            (cl-block nil
              (let* ((normalized-args (jf/gptel-scope--normalize-args raw-args))
                   ,@(cl-mapcar (lambda (name idx)
                                 `(,name (nth ,idx normalized-args)))
                               arg-names
                               (number-sequence 0 (1- (length arg-names))))
                   (config (jf/gptel-scope--load-config)))

              ;; Check allow-once FIRST (before checking if config exists)
              ;; Allow-once permissions should work even if config loading fails
              (when (jf/gptel-scope--check-allow-once ,name normalized-args config)
                (cl-return-from nil (progn ,@body)))

              ;; Check config exists (only if allow-once didn't grant permission)
              (unless config
                (cl-return-from nil
                  (list :success nil
                        :error "no_scope_config"
                        :message "No scope configuration found. Ensure scope.yml exists with paths section.")))

              ;; Check tool permission
              (let ((check-result (jf/gptel-scope--check-tool-permission
                                  config ,name normalized-args)))
                (if (plist-get check-result :allowed)
                    ;; Execute tool body
                    (progn ,@body)

                  ;; Format and return error
                  ;; Note: Expansion UI is triggered by LLM via request_scope_expansion tool,
                  ;; not automatically here. This maintains LLM-mediated communication pattern.
                  (jf/gptel-scope--format-tool-error
                   ,name
                   (nth 0 normalized-args)  ; Primary resource (first arg)
                   check-result)))))

          ;; Handle unexpected errors
          (error
           (list :success nil
                 :error "tool_exception"
                 :message (format "Tool error: %s" (error-message-string err)))))))))
#+end_src

** Usage Examples

*** Simple Read-Only Tool

#+begin_example elisp
(gptel-make-scoped-tool
 "read_file_in_scope"
 "Read file contents if in read scope."

 (list '(:name "filepath"
         :type string
         :description "Absolute file path to read"))

 "filesystem"

 ;; Tool body - filepath is available as a variable
 (condition-case err
     (list :success t
           :content (with-temp-buffer
                     (insert-file-contents filepath)
                     (buffer-string)))
   (error
    (list :success nil
          :error "read_failed"
          :message (error-message-string err)))))
#+end_example

*** Tool with Multiple Arguments

#+begin_example elisp
(gptel-make-scoped-tool
 "run_bash_command"
 "Execute shell command in specified directory."

 (list '(:name "command"
         :type string
         :description "Shell command to execute")
       '(:name "directory"
         :type string
         :description "Working directory"))

 "bash"

 ;; Both command and directory are available as variables
 (let* ((result (jf/gptel-bash--execute-command command directory))
        (exit-code (plist-get result :exit_code)))
   (list :success (zerop exit-code)
         :output (plist-get result :output)
         :exit_code exit-code)))
#+end_example

*** Valid Category Values

- ="filesystem"= - For file read/write operations (validates against :paths)
- ="org_roam"= - For org-roam node operations (validates against :org-roam-patterns)
- ="bash"= - For bash category-based operations (validates against :bash-tools)

*** Body Requirements

The BODY must return a plist with at minimum:
- =:success= - Boolean indicating operation success

On success, include operation-specific fields:
- =:content=, =:output=, =:result=, etc.

On failure, include:
- =:error= - Error type string
- =:message= - Human-readable error message

The macro handles:
- Scope validation errors (returns formatted error automatically)
- Unexpected exceptions (wrapped in condition-case)

You only need to handle tool-specific errors in BODY.

*** Common Patterns

*Error handling in body:*
#+begin_example elisp
(condition-case err
    (progn
      ;; risky operation
      (list :success t :result value))
  (error
   (list :success nil
         :error "operation_failed"
         :message (error-message-string err))))
#+end_example

*Argument binding:*
Arguments are automatically bound as variables matching their =:name= field.
If ARGS contains =(:name "filepath")=, the variable =filepath= is available in BODY.

*First argument convention:*
The first argument should be the primary resource identifier (filepath, node-id, command, etc.)
This is used for error formatting when scope validation fails.

* Scope Configuration Location Convention

Tools locate scope configuration using a simple filesystem convention:

=scope.yml= (plain YAML, no frontmatter) in the same directory as =session.md=

Scope configuration contains:
- =paths= section for filesystem/projectile/treesitter tools
- =org_roam_patterns= section for org-roam tools
- =bash_tools= section for bash command tools with category-based validation

** Bash Tools Configuration Structure

The =bash_tools= section categorizes commands by operational impact and validates directory scope:

#+begin_example yaml
bash_tools:
  categories:
    read_only:
      commands: [ls, find, grep, rg, pwd, cat, head, tail, wc, file]
    safe_write:
      commands: [mkdir, touch, echo]
    dangerous:
      commands: []  # Requires explicit user approval
  deny:
    - rm
    - sudo
    - mv
    - chmod
    - shutdown
    - reboot
#+end_example

*** Command Categories

- *read_only* - Commands that only read data, allowed in paths.read or paths.write
- *safe_write* - Commands that create/modify safely, require paths.write
- *dangerous* - Commands requiring explicit approval via request_scope_expansion
- *deny* - Commands never allowed (destructive/security-sensitive)

*** Validation Flow

1. Check deny list first (highest priority)
2. Categorize base command (first token before pipes/redirects)
3. Resolve directory to absolute path and real path (symlink resolution)
4. Validate directory against category's path scope requirement:
   - read_only: requires paths.read OR paths.write
   - safe_write: requires paths.write
   - dangerous: always denied unless explicitly approved

This eliminates the need for complex lookups:
- No registry required
- No session ID tracking needed
- Filesystem is the source of truth

Tools execute in the context of the gptel buffer, which has the buffer-local variable
=jf/gptel--branch-dir= set during session initialization. The scope loading functions
use this to find =scope.yml= in the same directory as the context file.

* Configuration Loading Functions

** Load Scope Configuration

Load and parse scope configuration from scope.yml.

Convention: scope.yml is always in the same directory as session.md.

#+begin_src elisp
(require 'yaml)  ; Emacs built-in YAML parser

(defun jf/gptel-scope--load-config ()
  "Load scope configuration from scope.yml.
Returns plist with:
  :paths-read - List of allowed read paths
  :paths-write - List of allowed write paths
  :paths-deny - List of denied paths
  :org-roam-patterns - Plist with :subdirectory, :tags, :node-ids
  :bash-tools - Plist with :categories and :deny lists
                (YAML uses snake_case: bash_tools, read_only
                 Elisp uses kebab-case: :bash-tools, :read-only)

Uses buffer-local jf/gptel--branch-dir if available.
Returns nil if scope.yml not found or can't be parsed."
  (condition-case err
      (let ((context-dir (or (and (boundp 'jf/gptel--branch-dir) jf/gptel--branch-dir)
                             (and (buffer-file-name)
                                  (file-name-directory (buffer-file-name))))))
        (when context-dir
          (let ((scope-file (expand-file-name jf/gptel-session--scope-file context-dir)))
            (when (file-exists-p scope-file)
              (jf/gptel-scope--parse-scope-yml scope-file)))))
    (error
     (message "Error loading scope config: %s" (error-message-string err))
     nil)))
#+end_src

