config/gptel/scope/scope-core.el

;; Generic Scoped Tool Macro

;; This macro wraps the common pattern used by all scope-aware tools:
;; 1. Get session ID
;; 2. Load scope plan
;; 3. Check plan exists
;; 4. Validate tool permission
;; 5. Execute tool body if allowed
;; 6. Return formatted error if denied


;; [[file:scope-core.org::*Generic Scoped Tool Macro][Generic Scoped Tool Macro:1]]
(defmacro gptel-make-scoped-tool (name description args category &rest body)
  "Create a scope-aware gptel tool with automatic validation.

NAME: Tool name string (e.g., \"write_file_in_scope\")
DESCRIPTION: Tool description for LLM
ARGS: List of argument specs (same format as gptel-make-tool :args)
CATEGORY: Resource category (\"filesystem\", \"org_roam\", \"shell\")
BODY: Tool implementation - executed only if scope check passes

The macro automatically:
- Loads scope config from scope.yml in current buffer's directory
- Checks tool permission using v3.0 validation
- Normalizes arguments (vector->list)
- Formats errors on scope violation
- Handles exceptions

BODY is executed with tool arguments available as variables and should
return the success result plist. The first argument in ARGS should be
the primary resource identifier (filepath, node-id, command, etc.)."
  (let* ((arg-names (mapcar (lambda (arg-spec)
                             (intern (plist-get arg-spec :name)))
                           (eval args)))
         (lambda-list arg-names))
    `(gptel-make-tool
      :name ,name
      :description ,description
      :args ,args
      :category ,category
      :function
      (lambda (&rest raw-args)
        (condition-case err
            (cl-block nil
              (let* ((normalized-args (jf/gptel-scope--normalize-args raw-args))
                   ,@(cl-mapcar (lambda (name idx)
                                 `(,name (nth ,idx normalized-args)))
                               arg-names
                               (number-sequence 0 (1- (length arg-names))))
                   (config (jf/gptel-scope--load-config)))

              ;; Check allow-once FIRST (before checking if config exists)
              ;; Allow-once permissions should work even if config loading fails
              (when (jf/gptel-scope--check-allow-once ,name normalized-args config)
                (cl-return-from nil (progn ,@body)))

              ;; Check config exists (only if allow-once didn't grant permission)
              (unless config
                (cl-return-from nil
                  (list :success nil
                        :error "no_scope_config"
                        :message "No scope configuration found. Ensure scope.yml exists with paths section.")))

              ;; Check tool permission
              (let ((check-result (jf/gptel-scope--check-tool-permission
                                  config ,name normalized-args)))
                (if (plist-get check-result :allowed)
                    ;; Execute tool body
                    (progn ,@body)

                  ;; Format and return error
                  ;; Note: Expansion UI is triggered by LLM via request_scope_expansion tool,
                  ;; not automatically here. This maintains LLM-mediated communication pattern.
                  (jf/gptel-scope--format-tool-error
                   ,name
                   (nth 0 normalized-args)  ; Primary resource (first arg)
                   check-result)))))

          ;; Handle unexpected errors
          (error
           (list :success nil
                 :error "tool_exception"
                 :message (format "Tool error: %s" (error-message-string err)))))))))
;; Generic Scoped Tool Macro:1 ends here

;; Load Scope Configuration

;; Load and parse scope configuration from scope.yml.

;; Convention: scope.yml is always in the same directory as session.md.


;; [[file:scope-core.org::*Load Scope Configuration][Load Scope Configuration:1]]
(require 'yaml)  ; Emacs built-in YAML parser

(defun jf/gptel-scope--load-config ()
  "Load scope configuration from scope.yml.
Returns plist with:
  :paths-read - List of allowed read paths
  :paths-write - List of allowed write paths
  :paths-deny - List of denied paths
  :org-roam-patterns - Plist with :subdirectory, :tags, :node-ids
  :bash-tools - Plist with :categories and :deny lists
                (YAML uses snake_case: bash_tools, read_only
                 Elisp uses kebab-case: :bash-tools, :read-only)

Uses buffer-local jf/gptel--branch-dir if available.
Returns nil if scope.yml not found or can't be parsed."
  (condition-case err
      (let ((context-dir (or (and (boundp 'jf/gptel--branch-dir) jf/gptel--branch-dir)
                             (and (buffer-file-name)
                                  (file-name-directory (buffer-file-name))))))
        (when context-dir
          (let ((scope-file (expand-file-name jf/gptel-session--scope-file context-dir)))
            (when (file-exists-p scope-file)
              (jf/gptel-scope--parse-scope-yml scope-file)))))
    (error
     (message "Error loading scope config: %s" (error-message-string err))
     nil)))
;; Load Scope Configuration:1 ends here
