config/gptel/scope/scope-core.org
** Key Normalization Helper

Normalize YAML keys by converting underscores to hyphens for internal consistency.

*Bidirectional conversion:*
- *Read path*: YAML =bash_tools= (snake_case) → Elisp =:bash-tools= (kebab-case)
- *Write path*: Elisp =:bash-tools= (kebab-case) → YAML =bash_tools= (snake_case)

This normalization is automatic and bidirectional:
1. When loading scope.yml, =jf/gptel-scope--normalize-plist-keys= converts all underscore keys to hyphens
2. When writing scope.yml, =jf/gptel-scope--kebab-to-snake= (in scope-expansion.org) converts hyphens back to underscores

*Example:* Users write =bash_tools= in YAML files, but code uses =:bash-tools= internally.

This is especially important for =bash_tools= since it's the most recent addition to the schema.

#+begin_src elisp
(defun jf/gptel-scope--normalize-plist-keys (plist)
  "Normalize all keys in PLIST by converting underscores to hyphens.
Recursively processes nested plists.
Example: :bash_tools -> :bash-tools, :read_only -> :read-only"
  (when plist
    (let ((result nil))
      (while plist
        (let* ((key (car plist))
               (value (cadr plist))
               (normalized-key (if (keywordp key)
                                   (intern (concat ":" (replace-regexp-in-string
                                                       "_" "-"
                                                       (substring (symbol-name key) 1))))
                                 key))
               (normalized-value (if (and (listp value)
                                         (keywordp (car value)))
                                    (jf/gptel-scope--normalize-plist-keys value)
                                  value)))
          (setq result (append result (list normalized-key normalized-value)))
          (setq plist (cddr plist))))
      result)))
#+end_src

** Parse Scope YAML

Parse scope configuration from a plain YAML file (no frontmatter).
Automatically normalizes all keys from underscore to hyphenated format.

#+begin_src elisp
(defun jf/gptel-scope--parse-scope-yml (scope-file)
  "Parse scope configuration from SCOPE-FILE (plain YAML, no frontmatter).
Returns plist with :paths-read, :paths-write, :paths-deny,
:org-roam-patterns, and :bash-tools.

Automatically normalizes all keys: underscored keys (bash_tools) are
converted to hyphenated keys (bash-tools) for consistency."
  (with-temp-buffer
    (insert-file-contents scope-file)
    (let* ((parsed (yaml-parse-string (buffer-string)
                                      :object-type 'plist
                                      :sequence-type 'list))
           (normalized (jf/gptel-scope--normalize-plist-keys parsed))
           (paths (plist-get normalized :paths))
           (org-roam (plist-get normalized :org-roam-patterns))
           (bash-tools (plist-get normalized :bash-tools)))
      (list :paths-read (plist-get paths :read)
            :paths-write (plist-get paths :write)
            :paths-deny (plist-get paths :deny)
            :org-roam-patterns org-roam
            :bash-tools bash-tools))))
#+end_src


* Allow-Once Mechanism

Temporary permissions that last only for the current LLM response turn.

** Consumption Semantics

*IMPORTANT:* Allow-once permissions are consumed *before* the tool body executes,
not after. This is a deliberate design choice with the following implications:

1. *Single-use guarantee:* Each permission can only be used once, even if multiple
   tool calls in the same LLM response attempt to use it.

2. *Permission consumed on check:* The permission is removed from the list when
   =jf/gptel-scope--check-allow-once= returns =t=, before the tool body runs.

3. *No rollback on failure:* If the tool body errors after the permission check,
   the permission is already consumed and cannot be retried.

4. *Race condition potential:* If an LLM response is interrupted (network error,
   timeout, user cancels) after permission check but before tool completion, the
   permission is consumed but the operation may not have completed.

This behavior is intentional to maintain security: allowing retry after failure
could enable repeated attempts at sensitive operations. Users can grant another
allow-once permission if needed.

The alternative approach (consuming after execution) would require tracking
tool execution state and handling partial failures, adding significant complexity
for minimal benefit.

** Buffer-Local Allow-Once List

#+begin_src elisp
(defvar-local jf/gptel-scope--allow-once-list nil
  "List of (tool-name . resource) pairs allowed for current LLM turn.
Each entry grants temporary permission for one tool call to one resource.
Cleared automatically after LLM response completes via gptel-post-response-functions.")
#+end_src

** Check Allow-Once

#+begin_src elisp
(defun jf/gptel-scope--check-allow-once (tool-name args config)
  "Check if TOOL-NAME with ARGS is in allow-once list.
Extracts resource from ARGS based on tool category.
Returns t if found (and consumes the permission), nil otherwise.

IMPORTANT: Permission is consumed when this function returns t, BEFORE the
tool body executes. This ensures single-use semantics but means permissions
cannot be retried if the tool body fails. See 'Consumption Semantics' above.

CONFIG is the scope configuration (used to determine tool category)."
  (when jf/gptel-scope--allow-once-list
    (let* ((category (cdr (assoc tool-name jf/gptel-scope--tool-categories)))
           (validation-type (plist-get category :validation))
           (resource (pcase validation-type
                      ('path (expand-file-name (car args)))
                      ('pattern (format "%s:%s" tool-name (car args)))
                      ('command (car args))
                      ('bash (format "%s:%s" (car args) (expand-file-name (cadr args))))  ; Composite: command:directory
                      (_ nil))))
      (when resource
        (when-let ((entry (assoc tool-name jf/gptel-scope--allow-once-list)))
          (when (equal (cdr entry) resource)
            ;; Consume permission (single-use)
            (setq jf/gptel-scope--allow-once-list
                  (delq entry jf/gptel-scope--allow-once-list))
            t))))))
#+end_src

** Add to Allow-Once List

#+begin_src elisp
(defun jf/gptel-scope-add-to-allow-once-list (tool-name resource)
  "Add TOOL-NAME and RESOURCE to allow-once list.
Permission is valid only for current LLM turn.

This is a public API function used by scope-expansion and other modules."
  (push (cons tool-name resource) jf/gptel-scope--allow-once-list))
#+end_src

** Clear Allow-Once After Response

#+begin_src elisp
(defun jf/gptel-scope--clear-allow-once (&rest _)
  "Clear allow-once list after LLM response completes.
Hooked into gptel-post-response-functions."
  (when (boundp 'jf/gptel-scope--allow-once-list)
    (setq-local jf/gptel-scope--allow-once-list nil)))

;; Hook into gptel response lifecycle
(add-hook 'gptel-post-response-functions #'jf/gptel-scope--clear-allow-once)
#+end_src

* Validation System (v3.0)

This section implements the v3.0 validation system with three strategies:
path-based, pattern-based, and command-based.

** Pattern Matching Helper

Check if a path matches any pattern in a list.

#+begin_src elisp
(defun jf/gptel-scope--matches-any-pattern (path patterns)
  "Check if PATH matches any pattern in PATTERNS list.
Returns t if any pattern matches, nil otherwise."
  (when patterns
    (cl-some (lambda (pattern)
              (jf/gptel-scope--matches-pattern path pattern))
            patterns)))
#+end_src

