config/gptel/scope/scope-core.el

;; Key Normalization Helper

;; Normalize YAML keys by converting underscores to hyphens for internal consistency.

;; *Bidirectional conversion:*
;; - *Read path*: YAML =bash_tools= (snake_case) → Elisp =:bash-tools= (kebab-case)
;; - *Write path*: Elisp =:bash-tools= (kebab-case) → YAML =bash_tools= (snake_case)

;; This normalization is automatic and bidirectional:
;; 1. When loading scope.yml, =jf/gptel-scope--normalize-plist-keys= converts all underscore keys to hyphens
;; 2. When writing scope.yml, =jf/gptel-scope--kebab-to-snake= (in scope-expansion.org) converts hyphens back to underscores

;; *Example:* Users write =bash_tools= in YAML files, but code uses =:bash-tools= internally.

;; This is especially important for =bash_tools= since it's the most recent addition to the schema.


;; [[file:scope-core.org::*Key Normalization Helper][Key Normalization Helper:1]]
(defun jf/gptel-scope--normalize-plist-keys (plist)
  "Normalize all keys in PLIST by converting underscores to hyphens.
Recursively processes nested plists.
Example: :bash_tools -> :bash-tools, :read_only -> :read-only"
  (when plist
    (let ((result nil))
      (while plist
        (let* ((key (car plist))
               (value (cadr plist))
               (normalized-key (if (keywordp key)
                                   (intern (concat ":" (replace-regexp-in-string
                                                       "_" "-"
                                                       (substring (symbol-name key) 1))))
                                 key))
               (normalized-value (if (and (listp value)
                                         (keywordp (car value)))
                                    (jf/gptel-scope--normalize-plist-keys value)
                                  value)))
          (setq result (append result (list normalized-key normalized-value)))
          (setq plist (cddr plist))))
      result)))
;; Key Normalization Helper:1 ends here

;; Parse Scope YAML

;; Parse scope configuration from a plain YAML file (no frontmatter).
;; Automatically normalizes all keys from underscore to hyphenated format.


;; [[file:scope-core.org::*Parse Scope YAML][Parse Scope YAML:1]]
(defun jf/gptel-scope--parse-scope-yml (scope-file)
  "Parse scope configuration from SCOPE-FILE (plain YAML, no frontmatter).
Returns plist with :paths-read, :paths-write, :paths-deny,
:org-roam-patterns, and :bash-tools.

Automatically normalizes all keys: underscored keys (bash_tools) are
converted to hyphenated keys (bash-tools) for consistency."
  (with-temp-buffer
    (insert-file-contents scope-file)
    (let* ((parsed (yaml-parse-string (buffer-string)
                                      :object-type 'plist
                                      :sequence-type 'list))
           (normalized (jf/gptel-scope--normalize-plist-keys parsed))
           (paths (plist-get normalized :paths))
           (org-roam (plist-get normalized :org-roam-patterns))
           (bash-tools (plist-get normalized :bash-tools)))
      (list :paths-read (plist-get paths :read)
            :paths-write (plist-get paths :write)
            :paths-deny (plist-get paths :deny)
            :org-roam-patterns org-roam
            :bash-tools bash-tools))))
;; Parse Scope YAML:1 ends here

;; Buffer-Local Allow-Once List


;; [[file:scope-core.org::*Buffer-Local Allow-Once List][Buffer-Local Allow-Once List:1]]
(defvar-local jf/gptel-scope--allow-once-list nil
  "List of (tool-name . resource) pairs allowed for current LLM turn.
Each entry grants temporary permission for one tool call to one resource.
Cleared automatically after LLM response completes via gptel-post-response-functions.")
;; Buffer-Local Allow-Once List:1 ends here

;; Check Allow-Once


;; [[file:scope-core.org::*Check Allow-Once][Check Allow-Once:1]]
(defun jf/gptel-scope--check-allow-once (tool-name args config)
  "Check if TOOL-NAME with ARGS is in allow-once list.
Extracts resource from ARGS based on tool category.
Returns t if found (and consumes the permission), nil otherwise.

IMPORTANT: Permission is consumed when this function returns t, BEFORE the
tool body executes. This ensures single-use semantics but means permissions
cannot be retried if the tool body fails. See 'Consumption Semantics' above.

CONFIG is the scope configuration (used to determine tool category)."
  (when jf/gptel-scope--allow-once-list
    (let* ((category (cdr (assoc tool-name jf/gptel-scope--tool-categories)))
           (validation-type (plist-get category :validation))
           (resource (pcase validation-type
                      ('path (expand-file-name (car args)))
                      ('pattern (format "%s:%s" tool-name (car args)))
                      ('command (car args))
                      ('bash (format "%s:%s" (car args) (expand-file-name (cadr args))))  ; Composite: command:directory
                      (_ nil))))
      (when resource
        (when-let ((entry (assoc tool-name jf/gptel-scope--allow-once-list)))
          (when (equal (cdr entry) resource)
            ;; Consume permission (single-use)
            (setq jf/gptel-scope--allow-once-list
                  (delq entry jf/gptel-scope--allow-once-list))
            t))))))
;; Check Allow-Once:1 ends here

;; Add to Allow-Once List


;; [[file:scope-core.org::*Add to Allow-Once List][Add to Allow-Once List:1]]
(defun jf/gptel-scope-add-to-allow-once-list (tool-name resource)
  "Add TOOL-NAME and RESOURCE to allow-once list.
Permission is valid only for current LLM turn.

This is a public API function used by scope-expansion and other modules."
  (push (cons tool-name resource) jf/gptel-scope--allow-once-list))
;; Add to Allow-Once List:1 ends here

;; Clear Allow-Once After Response


;; [[file:scope-core.org::*Clear Allow-Once After Response][Clear Allow-Once After Response:1]]
(defun jf/gptel-scope--clear-allow-once (&rest _)
  "Clear allow-once list after LLM response completes.
Hooked into gptel-post-response-functions."
  (when (boundp 'jf/gptel-scope--allow-once-list)
    (setq-local jf/gptel-scope--allow-once-list nil)))

;; Hook into gptel response lifecycle
(add-hook 'gptel-post-response-functions #'jf/gptel-scope--clear-allow-once)
;; Clear Allow-Once After Response:1 ends here

;; Pattern Matching Helper

;; Check if a path matches any pattern in a list.


;; [[file:scope-core.org::*Pattern Matching Helper][Pattern Matching Helper:1]]
(defun jf/gptel-scope--matches-any-pattern (path patterns)
  "Check if PATH matches any pattern in PATTERNS list.
Returns t if any pattern matches, nil otherwise."
  (when patterns
    (cl-some (lambda (pattern)
              (jf/gptel-scope--matches-pattern path pattern))
            patterns)))
;; Pattern Matching Helper:1 ends here
