config/gptel/scope/scope-core.el

;; Path-Based Validator

;; Validates filesystem, projectile, and treesitter tools against path lists.


;; [[file:scope-core.org::*Path-Based Validator][Path-Based Validator:1]]
(defun jf/gptel-scope--validate-path-tool (tool-name args category config)
  "Validate path-based tool against read/write/deny path lists.
TOOL-NAME is the tool being validated.
ARGS is the tool arguments list (first arg should be filepath).
CATEGORY is the tool category plist (:validation :operation).
CONFIG is the scope configuration plist.

Returns plist with:
  :allowed t/nil
  :reason STRING (if denied)
  :resource STRING (the filepath, if denied)
  :tool STRING (tool name, if denied)
  :allowed-patterns LIST (if denied for not matching)."
  (cl-block jf/gptel-scope--validate-path-tool
    (let* ((operation (plist-get category :operation))
           (filepath (car args))  ; First arg is always filepath
           (full-path (expand-file-name filepath))
           (read-paths (plist-get config :paths-read))
           (write-paths (plist-get config :paths-write))
           (deny-paths (plist-get config :paths-deny))
           (target-paths (if (eq operation 'read) read-paths write-paths)))

      ;; Check deny first (highest priority)
      (when (jf/gptel-scope--matches-any-pattern full-path deny-paths)
        (cl-return-from jf/gptel-scope--validate-path-tool
          (list :allowed nil
                :reason "denied-pattern"
                :resource full-path
                :tool tool-name)))

      ;; Check allow patterns
      (unless (jf/gptel-scope--matches-any-pattern full-path target-paths)
        (cl-return-from jf/gptel-scope--validate-path-tool
          (list :allowed nil
                :reason "not-in-scope"
                :resource full-path
                :tool tool-name
                :allowed-patterns target-paths)))

      ;; Passed
      (list :allowed t))))
;; Path-Based Validator:1 ends here

;; Pattern-Based Validator

;; Validates org-roam tools against org_roam_patterns section.


;; [[file:scope-core.org::*Pattern-Based Validator][Pattern-Based Validator:1]]
(defun jf/gptel-scope--validate-pattern-tool (tool-name args config)
  "Validate org-roam tool against org_roam_patterns section.
TOOL-NAME is the tool being validated.
ARGS is the tool arguments list (varies by tool).
CONFIG is the scope configuration plist.

Returns plist with:
  :allowed t/nil
  :reason STRING (if denied)
  :resource STRING (description of what was denied)
  :tool STRING (tool name, if denied)."
  (let ((org-roam-config (plist-get config :org-roam-patterns)))
    (pcase tool-name
      ("create_roam_node_in_scope"
       (let ((subdirectory (nth 1 args))  ; 2nd arg
             (tags (nth 2 args))          ; 3rd arg
             (allowed-subdirs (plist-get org-roam-config :subdirectory))
             (allowed-tags (plist-get org-roam-config :tags))
             (allowed nil))

         ;; Check subdirectory patterns (format: "gptel/**")
         (when (and subdirectory allowed-subdirs)
           (dolist (pattern allowed-subdirs)
             (when (string-match-p (jf/gptel-scope--glob-to-regex pattern)
                                 subdirectory)
               (setq allowed t))))

         ;; Check tag patterns (format: "gptel")
         (when (and tags allowed-tags)
           (dolist (tag tags)
             (when (member tag allowed-tags)
               (setq allowed t))))

         (if allowed
             (list :allowed t)
           (list :allowed nil
                 :reason "not-in-org-roam-patterns"
                 :resource (format "subdirectory:%s tags:%s"
                                 (or subdirectory "none")
                                 (or (mapconcat #'identity tags ",") "none"))
                 :tool tool-name))))

      ("add_roam_tags_in_scope"
       (let ((tags (nth 1 args))  ; 2nd arg
             (allowed-tags (plist-get org-roam-config :tags))
             (allowed nil))

         ;; Check tag patterns
         (when (and tags allowed-tags)
           (dolist (tag tags)
             (when (member tag allowed-tags)
               (setq allowed t))))

         (if allowed
             (list :allowed t)
           (list :allowed nil
                 :reason "not-in-org-roam-patterns"
                 :resource (format "tags:%s"
                                 (mapconcat #'identity tags ","))
                 :tool tool-name))))

      ("link_roam_nodes_in_scope"
       (let ((node-ids (plist-get org-roam-config :node-ids)))
         ;; Check if wildcard "*" is in allowed node_ids
         (if (member "*" node-ids)
             (list :allowed t)
           ;; Could extend to check specific node IDs here
           (list :allowed nil
                 :reason "not-in-org-roam-patterns"
                 :resource "node linking"
                 :tool tool-name))))

      (_
       ;; Unknown org-roam tool
       (list :allowed nil
             :reason "unknown-org-roam-tool"
             :resource tool-name
             :tool tool-name)))))
;; Pattern-Based Validator:1 ends here
