config/gptel/scope/scope-core.el

;; Validator Return Values

;; The bash validator returns structured error information to help the LLM understand what went wrong and how to fix it.

;; *Success case:*

;; [[file:scope-core.org::*Validator Return Values][Validator Return Values:1]]
(:allowed t)
;; Validator Return Values:1 ends here



;; *Error cases:*

;; 1. *Command not allowed* (command not in any category):

;; [[file:scope-core.org::*Validator Return Values][Validator Return Values:2]]
(:allowed nil
 :reason "command-not-allowed"
 :tool "run_bash_command"
 :resource "tree"
 :command "tree"
 :message "Command 'tree' is not in any bash_tools category (read_only, safe_write, dangerous). Use request_scope_expansion to request adding this command to an appropriate category.")
;; Validator Return Values:2 ends here



;; 2. *Denied command* (in bash_tools.deny list):

;; [[file:scope-core.org::*Validator Return Values][Validator Return Values:3]]
(:allowed nil
 :reason "denied-command"
 :tool "run_bash_command"
 :resource "rm -rf /tmp/file"
 :command "rm -rf /tmp/file"
 :message "Command 'rm' is explicitly denied in bash_tools.deny list.")
;; Validator Return Values:3 ends here



;; 3. *Directory not in scope* (directory doesn't match paths.read or paths.write):

;; [[file:scope-core.org::*Validator Return Values][Validator Return Values:4]]
(:allowed nil
 :reason "directory-not-in-scope"
 :tool "run_bash_command"
 :resource "/Users/jefffarr/other-project"
 :command "ls -la"
 :directory "/Users/jefffarr/other-project"
 :required-scope "read"
 :allowed-patterns ("/Users/jefffarr/emacs/**" "/Users/jefffarr/projects/**")
 :message "Directory '/Users/jefffarr/other-project' is not in scope for read operations. Command 'ls' requires read access. Use request_scope_expansion to request access.")
;; Validator Return Values:4 ends here



;; 4. *Dangerous command* (requires explicit approval):

;; [[file:scope-core.org::*Validator Return Values][Validator Return Values:5]]
(:allowed nil
 :reason "dangerous-command"
 :tool "run_bash_command"
 :resource "dangerous-cmd"
 :command "dangerous-cmd"
 :message "Command 'dangerous-cmd' is categorized as dangerous and requires explicit user approval via request_scope_expansion.")
;; Validator Return Values:5 ends here



;; 5. *No bash_tools configuration*:

;; [[file:scope-core.org::*Validator Return Values][Validator Return Values:6]]
(:allowed nil
 :reason "command-not-allowed"
 :tool "run_bash_command"
 :resource "ls"
 :command "ls"
 :message "No bash_tools configuration found. All commands denied by default.")
;; Validator Return Values:6 ends here

;; Implementation


;; [[file:scope-core.org::*Implementation][Implementation:1]]
(defun jf/gptel-scope--validate-bash-tool (tool-name args config)
