config/gptel/scope/scope-core.el
  "Validate bash command against bash_tools categories and paths.
TOOL-NAME is the tool being validated.
ARGS is the tool arguments list (command and directory).
CONFIG is the scope configuration plist.

Returns plist with:
  :allowed t/nil
  :reason STRING (if denied)
  :resource STRING (the denied resource - command or directory)
  :command STRING (the command, if denied)
  :directory STRING (the directory, if denied)
  :tool STRING (tool name, if denied)
  :message STRING (descriptive message)
  :required-scope STRING (read/write, if denied)
  :allowed-patterns LIST (if denied for directory not in scope)."
  (cl-block jf/gptel-scope--validate-bash-tool
    (let* ((command-full (car args))
           (directory (cadr args))
           (bash-config (plist-get config :bash-tools))
           (categories (plist-get bash-config :categories))
           (deny-list (plist-get bash-config :deny))
           (read-paths (plist-get config :paths-read))
           (write-paths (plist-get config :paths-write))
           (deny-paths (plist-get config :paths-deny)))

      ;; If bash_tools section is missing, deny all commands
      (unless bash-config
        (cl-return-from jf/gptel-scope--validate-bash-tool
          (list :allowed nil
                :reason "command-not-allowed"
                :tool tool-name
                :resource command-full
                :command command-full
                :message "No bash_tools configuration found. All commands denied by default.")))

      ;; Validate bash_tools structure is well-formed
      (unless (and categories (listp categories))
        (cl-return-from jf/gptel-scope--validate-bash-tool
          (list :allowed nil
                :reason "malformed-config"
                :tool tool-name
                :resource command-full
                :command command-full
                :message "Malformed bash_tools configuration: missing or invalid 'categories' section.")))

      ;; Validate required category sections exist
      (let ((read-only-section (plist-get categories :read-only))
            (safe-write-section (plist-get categories :safe-write))
            (dangerous-section (plist-get categories :dangerous)))
        (unless (and read-only-section safe-write-section dangerous-section)
          (cl-return-from jf/gptel-scope--validate-bash-tool
            (list :allowed nil
                  :reason "malformed-config"
                  :tool tool-name
                  :resource command-full
                  :command command-full
                  :message "Malformed bash_tools configuration: missing required category (read_only, safe_write, or dangerous).")))

        ;; Validate each category has a commands list
        (unless (and (plist-get read-only-section :commands)
                     (plist-get safe-write-section :commands)
                     (plist-get dangerous-section :commands))
          (cl-return-from jf/gptel-scope--validate-bash-tool
            (list :allowed nil
                  :reason "malformed-config"
                  :tool tool-name
                  :resource command-full
                  :command command-full
                  :message "Malformed bash_tools configuration: category missing 'commands' list."))))

      ;; Parse command to extract base command
      (let* ((command-parts (split-string command-full "[ |><;&]+" t))
             (base-command (car command-parts)))

        ;; Check deny list first (highest priority)
        (when (member base-command deny-list)
          (cl-return-from jf/gptel-scope--validate-bash-tool
            (list :allowed nil
                  :reason "denied-command"
                  :tool tool-name
                  :resource command-full
                  :command command-full
                  :message (format "Command '%s' is explicitly denied in bash_tools.deny list."
                                 base-command))))

        ;; Categorize command
        (let ((category nil)
              (read-only (plist-get (plist-get categories :read-only) :commands))
              (safe-write (plist-get (plist-get categories :safe-write) :commands))
              (dangerous (plist-get (plist-get categories :dangerous) :commands)))

          (cond
           ((member base-command read-only) (setq category 'read-only))
           ((member base-command safe-write) (setq category 'safe-write))
           ((member base-command dangerous) (setq category 'dangerous))
           (t
            ;; Unknown command - deny and suggest scope expansion
            (cl-return-from jf/gptel-scope--validate-bash-tool
              (list :allowed nil
                    :reason "command-not-allowed"
                    :tool tool-name
                    :resource command-full
                    :command command-full
                    :message (format "Command '%s' is not in any bash_tools category (read_only, safe_write, dangerous). Use request_scope_expansion to request adding this command to an appropriate category."
                                   base-command)))))

          ;; Dangerous commands always denied (require explicit expansion)
          (when (eq category 'dangerous)
            (cl-return-from jf/gptel-scope--validate-bash-tool
              (list :allowed nil
                    :reason "dangerous-command"
                    :tool tool-name
                    :resource command-full
                    :command command-full
                    :message (format "Command '%s' is categorized as dangerous and requires explicit user approval via request_scope_expansion."
                                   base-command))))

          ;; Resolve directory to absolute path
          (let* ((abs-directory (expand-file-name directory))
                 (real-directory (file-truename abs-directory))
                 (required-scope (if (eq category 'read-only) "read" "write")))

            ;; Check deny paths first (overrides all)
            (when (jf/gptel-scope--matches-any-pattern real-directory deny-paths)
              (cl-return-from jf/gptel-scope--validate-bash-tool
                (list :allowed nil
                      :reason "denied-path"
                      :tool tool-name
                      :resource real-directory
                      :command command-full
                      :directory real-directory
                      :message (format "Directory '%s' is explicitly denied in paths.deny list."
                                     real-directory))))

            ;; Validate directory against category requirement
            (pcase category
              ('read-only
               ;; Read commands allowed in paths.read OR paths.write
               (unless (or (jf/gptel-scope--matches-any-pattern real-directory read-paths)
                          (jf/gptel-scope--matches-any-pattern real-directory write-paths))
                 (cl-return-from jf/gptel-scope--validate-bash-tool
                   (list :allowed nil
                         :reason "directory-not-in-scope"
                         :tool tool-name
                         :resource real-directory
                         :command command-full
                         :directory real-directory
                         :required-scope required-scope
                         :allowed-patterns (append read-paths write-paths)
                         :message (format "Directory '%s' is not in scope for read operations. Command '%s' requires read access. Use request_scope_expansion to request access."
                                        real-directory base-command)))))

              ('safe-write
               ;; Write commands require paths.write only
               (unless (jf/gptel-scope--matches-any-pattern real-directory write-paths)
                 (cl-return-from jf/gptel-scope--validate-bash-tool
                   (list :allowed nil
                         :reason "directory-not-in-scope"
                         :tool tool-name
                         :resource real-directory
                         :command command-full
                         :directory real-directory
                         :required-scope required-scope
                         :allowed-patterns write-paths
                         :message (format "Directory '%s' is not in scope for write operations. Command '%s' requires write access. Use request_scope_expansion to request access."
                                        real-directory base-command))))))

            ;; Passed all checks
            (list :allowed t)))))))
;; Implementation:1 ends here
