config/gptel/scope/scope-core.org
** Tool Permission Dispatch

Central dispatcher that routes permission checks to tool-specific validators based on tool categories.

#+begin_src elisp
(defun jf/gptel-scope--check-tool-permission (config tool-name args)
  "Validate TOOL-NAME with ARGS against CONFIG.
CONFIG is the scope configuration plist from scope.yml.
TOOL-NAME is the tool being validated.
ARGS is the tool arguments list.

Returns plist with:
  :allowed t/nil
  :reason STRING (if denied)
  :resource STRING (what was denied, if applicable)
  :tool STRING (tool name, if denied)
  :allowed-patterns LIST (if denied for not matching)."

  ;; Check allow-once first (highest priority)
  (when (jf/gptel-scope--check-allow-once tool-name args config)
    (cl-return-from jf/gptel-scope--check-tool-permission
      (list :allowed t :reason "allow-once")))

  ;; Lookup tool category
  (let* ((category (cdr (assoc tool-name jf/gptel-scope--tool-categories)))
         (validation-type (plist-get category :validation)))

    ;; Meta tools always pass
    (when (eq validation-type 'meta)
      (cl-return-from jf/gptel-scope--check-tool-permission
        (list :allowed t)))

    ;; Route to validator
    (pcase validation-type
      ('path (jf/gptel-scope--validate-path-tool tool-name args category config))
      ('pattern (jf/gptel-scope--validate-pattern-tool tool-name args config))
      ('bash (jf/gptel-scope--validate-bash-tool tool-name args config))
      (_
       ;; Unknown tool - deny by default
       (list :allowed nil
             :reason "unknown-tool"
             :resource tool-name
             :tool tool-name)))))
#+end_src



* Glob Pattern Matching

** Convert Glob to Regex

Convert glob patterns to regex, supporting =**=, =*=, and =?= wildcards.

#+begin_src elisp
(defun jf/gptel-scope--glob-to-regex (pattern)
  "Convert glob PATTERN to regex string.
Supports:
  ** - Match any characters including /
  *  - Match any characters except /
  ?  - Match single character"
  (let ((regex pattern))
    ;; Escape regex special characters (except * and ?)
    (setq regex (replace-regexp-in-string "[.+^$()\\[\\]{}|\\\\]" "\\\\\\&" regex))
    ;; Convert glob wildcards to regex
    (setq regex (replace-regexp-in-string "\\*\\*" "DOUBLESTAR" regex))
    (setq regex (replace-regexp-in-string "\\*" "[^/]*" regex))
    (setq regex (replace-regexp-in-string "DOUBLESTAR" ".*" regex))
    (setq regex (replace-regexp-in-string "\\?" "." regex))
    ;; Anchor pattern
    (concat "^" regex "$")))
#+end_src

** Test Path Against Pattern

Check if a path matches a glob pattern.

#+begin_src elisp
(defun jf/gptel-scope--matches-pattern (path pattern)
  "Check if PATH matches glob PATTERN.
Expands relative paths to absolute, resolves symlinks."
  (let* ((abs-path (expand-file-name path))
         (real-path (file-truename abs-path))
         (expanded-pattern (expand-file-name pattern))
         (regex (jf/gptel-scope--glob-to-regex expanded-pattern)))
    (or (string-match-p regex real-path)
        (string-match-p regex abs-path))))
#+end_src


* Error Formatting

** Format Tool Error

Create standardized error response for tool-level permission violations.

#+begin_src elisp
(defun jf/gptel-scope--format-tool-error (tool-name resource check-result)
  "Format tool permission error for LLM.
TOOL-NAME: Name of the tool that was denied
RESOURCE: The resource that was denied (path, node-id, command, etc.)
CHECK-RESULT: Plist from validator with :allowed, :patterns/:allowed-patterns, :deny-patterns, :reason/:error"
  (let ((patterns (or (plist-get check-result :allowed-patterns)  ; Bash validator uses :allowed-patterns
                      (plist-get check-result :patterns)))        ; Other validators use :patterns
        (deny-patterns (plist-get check-result :deny-patterns))
        (error-type (or (plist-get check-result :reason)          ; Bash validator uses :reason
                        (plist-get check-result :error)           ; Other validators use :error
                        "scope-violation"))
        (custom-message (plist-get check-result :message))
        ;; Extract bash-specific fields (will be nil for non-bash tools)
        (command (plist-get check-result :command))
        (directory (plist-get check-result :directory))
        (required-scope (plist-get check-result :required-scope)))
    (list :success nil
          :error error-type
          :tool tool-name
          :resource resource
          :command command                    ; Pass through bash command field
          :directory directory                ; Pass through bash directory field
          :required-scope required-scope      ; Pass through required scope level
          :allowed-patterns patterns
          :deny-patterns deny-patterns
          :message (or custom-message
                      (format "Tool '%s' denied for resource '%s'. Use request_scope_expansion to ask user for approval."
                             tool-name
                             resource)))))
#+end_src

* Provide Feature

#+begin_src elisp
(provide 'jf-gptel-scope-core)
;;; scope-core.el ends here
#+end_src
